# Importing necessary libraries

In [1]:
import pandas as pd
import numpy as np

# Loading dataset

## Transactions Data

In [2]:
filepath = ".\KPMG_VI_New_raw_data_update_final.xlsx"
tran_df = pd.read_excel(filepath, sheet_name="Transactions", header=1)
tran_df.shape

(20000, 13)

In [3]:
tran_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [4]:
tran_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

The following issues are evident:
* Missing data in columns:
    online_order, brand, product_line, product_class, product_size, standard_cost, and product_first_sold_date,
* product_first_sold_date column has the wrong data type, date_value instead of datetime

In [5]:
tran_df['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [6]:
tran_df['customer_id'].nunique()

3494

In [7]:
tran_df['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [8]:
tran_df['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [9]:
tran_df['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [10]:
tran_df['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

There is a confusing choice for product_class and product_size which use the same categorical values.

Product specific data should be in its own table

dropping all rows with missing values

In [17]:
tran_clean = tran_df.dropna()
tran_clean.shape

(19445, 13)

In [18]:
#saving df to csv file
#tran_clean.to_csv("transactions_clean.csv", index=False)

## Customer Addresses

In [11]:
add_df = pd.read_excel(filepath, sheet_name="CustomerAddress", header=1)
add_df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [12]:
add_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

No missing data for addresses

In [13]:
add_df.sample(10)

,customer_id,address,postcode,state,country,property_valuation
3329,3334,54 Hermina Road,2000,NSW,Australia,12
3032,3037,01654 Milwaukee Plaza,2000,NSW,Australia,11
2446,2451,71761 Almo Street,4178,QLD,Australia,7
3692,3697,2 Union Way,2035,NSW,Australia,12
1249,1254,563 Northport Drive,4701,QLD,Australia,1
3407,3412,5767 Thierer Road,2217,NSW,Australia,8
3910,3915,47 Spenser Circle,2770,NSW,Australia,7
3611,3616,4643 Cambridge Circle,3064,VIC,Australia,6
791,796,414 Kensington Lane,3076,VIC,Australia,8
888,893,1 5th Parkway,2148,NSW,Australia,8

Some states are written in full while some are abbreviations

In [19]:
add_df['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [21]:
#replacing full state names with abbreviations
add_df['state'].replace({'New South Wales':'NSW', 'Victoria':'VIC'}, inplace=True)

In [22]:
add_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [23]:
#saving clean addresses to csv
#add_df.to_csv('addresses_clean.csv', index=False)

## Customer Demographic

In [14]:
demo_df = pd.read_excel(filepath, sheet_name="CustomerDemographic", header=1)
demo_df.head()

C:\Users\Siba785\AppData\Local\Temp\ipykernel_18128\951521303.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  demo_df = pd.read_excel(filepath, sheet_name="CustomerDemographic", header=1)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [15]:
demo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

missing data in columns: last_name, DOB, job_title, job_industry_category, default, and tenure

column *default* contains some invalid characters, so will drop it.

In [34]:
demo_df.drop(columns=['default'],inplace=True)

In [24]:
demo_df['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [26]:
demo_df['gender'].replace({'F':'Female', 'Femal':'Female', 'M':'Male'}, inplace=True)

In [32]:
#lets see the entries with gender as U, if we can map out the proper gender
demo_df.query('gender == "U"').sample(10)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
3997,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN
453,454,Eugenie,Domenc,U,58,NaT,Research Nurse,Health,Affluent Customer,N,NaN,Yes,NaN
2646,2647,Marcelia,Blannin,U,1,NaT,Physical Therapy Assistant,IT,High Net Worth,N,NaN,No,NaN
2695,2696,Isabelle,Bursnoll,U,42,NaT,Social Worker,Health,Mass Customer,N,NaN,Yes,NaN
167,168,Reggie,Broggetti,U,8,NaT,General Manager,IT,Affluent Customer,N,NaN,Yes,NaN
3778,3779,Ulick,Daspar,U,68,NaT,NaN,IT,Affluent Customer,N,NaN,No,NaN
1989,1990,Mira,Askham,U,9,NaT,Senior Financial Analyst,Financial Services,High Net Worth,N,NaN,No,NaN
1508,1509,Sibley,Janek,U,10,NaT,Computer Systems Analyst I,IT,High Net Worth,N,NaN,Yes,NaN
3085,3086,Pieter,Gadesby,U,18,NaT,Biostatistician I,IT,High Net Worth,N,NaN,No,NaN
1037,1038,Fraser,Acome,U,57,NaT,Engineer I,Manufacturing,Mass Customer,N,NaN,Yes,NaN

Will leave those with gender as U as is.

In [35]:
demo_df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [36]:
##using DOB to calculate customer age
demo_df['DOB'].dtype

dtype('<M8[ns]')

In [41]:
from datetime import datetime, date
today = date.today()

def age_converter(birth_date):
    born = birth_date.date()
    age = today.year - born.year - ((today.month, today.day) < (born.month, born.day))
    return age

In [44]:
demo_df['Age'] = demo_df['DOB'].apply(age_converter)

In [45]:
demo_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,Age
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,69.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,41.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,68.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,61.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,45.0

In [46]:
demo_df.drop(columns=['DOB'], inplace=True)

In [47]:
#saving dataframe to csv
#demo_df.to_csv("demographics_clean.csv", index=False)